Revit 2027 API
UV.Divide Method
Divides this 2-D vector by the specified value and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV Divide(
	double value
)
Public Function Divide (
	value As Double
) As UV
public:
UV^ Divide(
	double value
)
member Divide :
        value : float -> UV
Parameters
value Double
The value to divide this vector by.
Return Value
UV
The divided 2-D vector.
Exceptions
Exception | Condition
ArgumentException |  Thrown when the specified value is an infinite number.
ArgumentException |  Thrown when the specified value is zero.
Remarks
 The divided vector is obtained by dividing each coordinate of this vector by the specified value.
See Also
Reference
UV Class
Autodesk.Revit.DB Namespace